tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"
tap "weaveworks/tap"

brew "awscli"
brew "bat"
brew "curl"
brew "docker"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "go"
brew "grep"
brew "jq"
brew "k6"
brew "kubernetes-cli"
brew "kubectx"
brew "lsd"
brew "mas"
brew "mosh"
brew "neofetch"
brew "neovim"
brew "peco"
brew "terraform"
brew "tig"
brew "tmux"
brew "unzip"
brew "wget"
brew "yarn"
brew "derailed/k9s/k9s"
brew "jesseduffield/lazygit/lazygit"
brew "weaveworks/tap/eksctl"

cask "alfred"
cask "deskpad"
cask "font-hack-nerd-font"
cask "obsidian"
cask "rectangle"
cask "visual-studio-code"
cask "arc"


vscode "1yib.rust-bundle"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "jdinhlife.gruvbox"
vscode "keifererikson.nightfox"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "marp-team.marp-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "serayuzgur.crates"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
